### 1. Import required datasets

In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

### 2. Given below dictionary, convert it into a dataframe

In [105]:
data = {"Sr.no": [1,2,3,4], "Name": ["Gaurav","Ayushi","Sachin","Shikha"],
        "Hobbies": ["Music", "DIY", "Driving", "Cricket"], "Score": [10,20,30,40]}
data

{'Sr.no': [1, 2, 3, 4],
 'Name': ['Gaurav', 'Ayushi', 'Sachin', 'Shikha'],
 'Hobbies': ['Music', 'DIY', 'Driving', 'Cricket'],
 'Score': [10, 20, 30, 40]}

In [106]:
df = pd.DataFrame(data)
df

   Sr.no    Name  Hobbies  Score
0      1  Gaurav    Music     10
1      2  Ayushi      DIY     20
2      3  Sachin  Driving     30
3      4  Shikha  Cricket     40

### 2. Use ".columns:" iterator to Change all the scores to 10

In [68]:
z = df.copy()
for i in z.columns:
    if i == 'Score':
        z[i] = 10
z

   Sr.no    Name  Hobbies  Score
0      1  Gaurav    Music     10
1      2  Ayushi      DIY     10
2      3  Sachin  Driving     10
3      4  Shikha  Cricket     10

In [69]:
data['Score'] = 10

In [70]:
pd.DataFrame(data)

   Sr.no    Name  Hobbies  Score
0      1  Gaurav    Music     10
1      2  Ayushi      DIY     10
2      3  Sachin  Driving     10
3      4  Shikha  Cricket     10

### 3. Change labels of categorical data into numerical labels (useful in decision tree etc.)

In [71]:
z = df.copy()
z['Name'] = z['Name'].astype('category').cat.codes
z['Hobbies'] = z['Hobbies'].astype('category').cat.codes

In [72]:
z

   Sr.no  Name  Hobbies  Score
0      1     1        3     10
1      2     0        1     20
2      3     2        2     30
3      4     3        0     40

### 4. Convert Column names to upper case

In [73]:
df.columns = df.columns.str.upper()
df.columns

Index(['SR.NO', 'NAME', 'HOBBIES', 'SCORE'], dtype='object')

### 5. Print each of the rows in the dataset using iterrows()

In [74]:
for index, row in df.iterrows():
     print(i,'\n', row)

Score
 SR.NO           1
NAME       Gaurav
HOBBIES     Music
SCORE          10
Name: 0, dtype: object
Score
 SR.NO           2
NAME       Ayushi
HOBBIES       DIY
SCORE          20
Name: 1, dtype: object
Score
 SR.NO            3
NAME        Sachin
HOBBIES    Driving
SCORE           30
Name: 2, dtype: object
Score
 SR.NO            4
NAME        Shikha
HOBBIES    Cricket
SCORE           40
Name: 3, dtype: object

### 6.  Use Iterrows to convert "DIY" hobby to "painting"

In [76]:
for index, row in z.iterrows():
    if row['Hobbies'] == 'DIY':
        z.at[index, 'Hobbies'] = 'painting'

In [78]:
z

   Sr.no  Name  Hobbies  Score
0      1     1        3     10
1      2     0        1     20
2      3     2        2     30
3      4     3        0     40

### 7. Using .loc change the Hobbies back to "DIY" in 2nd row

In [107]:
data = df.copy()

In [91]:
data.loc[data['Hobbies'] == 'painting'] = 'DIY'
data

  Sr.no    Name  Hobbies Score
0     1  Gaurav    Music    10
1     2  Ayushi      DIY    20
2     3  Sachin  Driving    30
3     4  Shikha  Cricket    40

In [94]:
df.loc[df['Hobbies'] == 'DIY'] = 'painting'
df

  Sr.no    Name  Hobbies Score
0     1  Gaurav    Music    10
1     2  Ayushi  drawing    20
2     3  Sachin  Driving    30
3     4  Shikha  Cricket    40

In [95]:
df.loc[1,['Hobbies']] = ['drawing']
df

  Sr.no    Name  Hobbies Score
0     1  Gaurav    Music    10
1     2  Ayushi  drawing    20
2     3  Sachin  Driving    30
3     4  Shikha  Cricket    40

### 8. Using .loc change the Hobbies back to "painting " and score to '10'

In [96]:
#Using .loc change the Hobbies back to "painting " and score to '10'
data.loc[1,['Hobbies','Score']] = ["painting",10]
data

  Sr.no    Name   Hobbies Score
0     1  Gaurav     Music    10
1     2  Ayushi  painting    10
2     3  Sachin   Driving    30
3     4  Shikha   Cricket    40

### 9. Use .loc and length to add a new row to x dataframe

In [97]:
data.loc[len(data)] = [5,'Shiven', 'Driving', 20]
data

  Sr.no    Name   Hobbies Score
0     1  Gaurav     Music    10
1     2  Ayushi  painting    10
2     3  Sachin   Driving    30
3     4  Shikha   Cricket    40
4     5  Shiven   Driving    20

### 10. Insert a row in last 2nd row using .loc and length

In [108]:
data.loc[len(df) -2] = [3,'Sushmita', 'Guitar', 20]
data

   Sr.no      Name  Hobbies  Score
0      1    Gaurav    Music     10
1      2    Ayushi      DIY     20
2      3  Sushmita   Guitar     20
3      4    Shikha  Cricket     40

### 11. Add a column with email info

In [33]:
df['email'] = ['Gaurav1@gmail.com', 'Ayushi@gmail.com', 'Sachin@gmail.com','Shikha@gmail.com']
df

   Sr.no      Name  Hobbies  Score              email
0      1    Gaurav    Music     10  Gaurav1@gmail.com
1      2    Ayushi      DIY     20   Ayushi@gmail.com
2      3  Sushmita   Guitar     20   Sachin@gmail.com
3      4    Shikha  Cricket     40   Shikha@gmail.com

### 12. Convert all the letters in email to lowercase

In [35]:
df['email'] = df['email'].str.lower()
df

   Sr.no      Name  Hobbies  Score              email
0      1    Gaurav    Music     10  gaurav1@gmail.com
1      2    Ayushi      DIY     20   ayushi@gmail.com
2      3  Sushmita   Guitar     20   sachin@gmail.com
3      4    Shikha  Cricket     40   shikha@gmail.com

In [37]:
df['email'] = [i.lower() for i in df['email']]
df

   Sr.no      Name  Hobbies  Score              email
0      1    Gaurav    Music     10  gaurav1@gmail.com
1      2    Ayushi      DIY     20   ayushi@gmail.com
2      3  Sushmita   Guitar     20   sachin@gmail.com
3      4    Shikha  Cricket     40   shikha@gmail.com

### 12. Use apply and lambda function to convert the email entries to upper case

In [39]:
df['email'] = df['email'].apply(lambda x :x.upper())
df

   Sr.no      Name  Hobbies  Score              email
0      1    Gaurav    Music     10  GAURAV1@GMAIL.COM
1      2    Ayushi      DIY     20   AYUSHI@GMAIL.COM
2      3  Sushmita   Guitar     20   SACHIN@GMAIL.COM
3      4    Shikha  Cricket     40   SHIKHA@GMAIL.COM

### 13. Use map function to change Names to uppercase

In [41]:
df['email'] = df['email'].map(lambda x : x.upper())
df

   Sr.no      Name  Hobbies  Score              email
0      1    Gaurav    Music     10  GAURAV1@GMAIL.COM
1      2    Ayushi      DIY     20   AYUSHI@GMAIL.COM
2      3  Sushmita   Guitar     20   SACHIN@GMAIL.COM
3      4    Shikha  Cricket     40   SHIKHA@GMAIL.COM

### 14. Using loc insert a column email_id with values

['Gaurav@gmail','Ayushi@gmail','Sachin@gmail','Shikha@gmail']

In [109]:
data.insert(loc = 2,column='Email',value = ['Gaurav@gmail','Ayushi@gmail','Sachin@gmail','Shikha@gmail'])
data

   Sr.no      Name         Email  Hobbies  Score
0      1    Gaurav  Gaurav@gmail    Music     10
1      2    Ayushi  Ayushi@gmail      DIY     20
2      3  Sushmita  Sachin@gmail   Guitar     20
3      4    Shikha  Shikha@gmail  Cricket     40

### 15. Create a column col1 as the first column and insert the below values.

['Gaurav@gmail','Ayushi@gmail','Sachin@gmail','Shikha']

In [48]:
df.insert(loc = 1,
          column = 'col1',
          value = ['Gaurav@gmail','Ayushi@gmail','Sachin@gmail','Shikha'])

In [49]:
df

,Sr.no,col1,Name,email_id,Hobbies,Score,email
0,1,Gaurav@gmail,Gaurav,Gaurav@gmail,Music,10,GAURAV1@GMAIL.COM
1,2,Ayushi@gmail,Ayushi,Ayushi@gmail,DIY,20,AYUSHI@GMAIL.COM
2,3,Sachin@gmail,Sushmita,Sachin@gmail,Guitar,20,SACHIN@GMAIL.COM
3,4,Shikha,Shikha,Shikha@gmail,Cricket,40,SHIKHA@GMAIL.COM